all-posts.org
#-*- mode: org -*-
#+title: Hugo blog source
#+author: YAMASHITA Takao

#+category: blogger_hugo
#+startup: contents align shrink
#+options: AUTHOR:nil
#+hugo_base_dir: ./
#+hugo_auto_set_lastmod: t
#+hugo_section: blog

** DONE Hugo
:PROPERTIES:
:EXPORT_FILE_NAME: 2020-64ac-ab0e
:EXPORT_DATE: 2020-10-27 22:46:10
:EXPORT_HUGO_TAGS: hugo
:EXPORT_HUGO_CATEGORIES:
:EXPORT_HUGO_LASTMOD:
:END:
*** Hexo から Hugo
   :PROPERTIES:
   :CUSTOM_ID: hexo-から-hugo
   :END:
サイトジェネレータを [[https://https://gohugo.io][Hugo]] に変えてみた。
インストールといっても、homebrew を使うので簡単ですが :grin:

[[https://www.webfx.com/tools/emoji-cheat-sheet/][EMOJI-CHEAT-SHEET]]
*** インストール
   :PROPERTIES:
   :CUSTOM_ID: インストール
   :END:
[[https://brew.sh/index_ja][Homebrew]] はインストール済みとして、
#+BEGIN_SRC sh
  $ brew update
  $ brew install hugo
#+END_SRC
テーマは、[[https://conao3.com][conao3さん]] の
[[https://github.com/conao3/anatole-ext][anatole-ext]] にした。
#+BEGIN_SRC sh
  $ hugo new site hoge
  $ cd hoge
  $ git clone https://github.com/conao3/anatole-ext themes/anatole-ext
  $ hugo new posts/first-article.md
#+END_SRC
これで hoge ディレクトリーが作成され、その配下に雛形が作成される。
*** 自分用のメモ
**** 展開
#+BEGIN_SRC sh
  $ git clone git@github.com:ac1965/hugo-blog.git ./hugo-blog
  $ cd hugo-blog
  $ git submodule init
  $ git submodule update
  $ git submodule foreach git pull origin master
  $ hugo
#+END_SRC
hugo コマンドで、publicディレクトリ下にコンテンツが生成される。
**** `deploy.sh'
hexo と大きく違うのは deploy は利用者まかせかな。

私の環境では本体と公開用の gitリポジトリで管理していて、 本体は
hugo-blog、公開用は ac1965.github.com で分けている。
#+BEGIN_SRC sh
  #! /bin/bash

  hugo=~/devel/src/github.com/ac1965/hugo-blog
  public=~/devel/src/github.com/ac1965/ac1965.github.io

oが最近のお気に入りだ。
