content/blog/2020-64ac-ab0e.md
---
title: "Hugo"
date: 2020-10-27T22:46:00+09:00
lastmod: 2021-02-20T17:00:48+09:00
tags: ["hugo"]
draft: false
---

## Hexo から Hugo {#hexo-から-hugo}

サイトジェネレータを [Hugo](https://https//gohugo.io) に変えてみた。
インストールといっても、homebrew を使うので簡単ですが :grin:

[EMOJI-CHEAT-SHEET](https://www.webfx.com/tools/emoji-cheat-sheet/)


## インストール {#インストール}

[Homebrew](https://brew.sh/index%5Fja) はインストール済みとして、

```sh
$ brew update
$ brew install hugo
```

テーマは、[conao3さん](https://conao3.com) の
[anatole-ext](https://github.com/conao3/anatole-ext) にした。

```sh
$ hugo new site hoge
$ cd hoge
$ git clone https://github.com/conao3/anatole-ext themes/anatole-ext
$ hugo new posts/first-article.md
```

これで hoge ディレクトリーが作成され、その配下に雛形が作成される。


## 自分用のメモ {#自分用のメモ}


### 展開 {#展開}

```sh
$ git clone git@github.com:ac1965/hugo-blog.git ./hugo-blog
$ cd hugo-blog
$ git submodule init
$ git submodule update
$ git submodule foreach git pull origin master
$ hugo
```

hugo コマンドで、publicディレクトリ下にコンテンツが生成される。


### \`deploy.sh' {#deploy-dot-sh}

hexo と大きく違うのは deploy は利用者まかせかな。

私の環境では本体と公開用の gitリポジトリで管理していて、 本体は
hugo-blog、公開用は ac1965.github.com で分けている。
\#+BEGIN\_SRC sh
  #! /bin/bash

hugo=~/devel/src/github.com/ac1965/hugo-blog
public=~/devel/src/github.com/ac1965/ac1965.github.io